backend/app/controllers/movies_controller.rb

INSERT INTO "movies" ("title", "watch_list_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "The Hobbit: An Unexpected Journey"], ["watch_list_id", 1], ["created_at", "2021-05-07 08:02:42.454300"], ["updated_at", "2021-05-07 08:02:42.454300"]]
---
    def create
        movie = Movie.create(movie_params)

SELECT "movies".* FROM "movies" WHERE "movies"."id" = ? LIMIT ?  [["id", 27], ["LIMIT", 1]]
DELETE FROM "movies" WHERE "movies"."id" = ?  [["id", 27]]
---
    def destroy
        movie = Movie.find_by(id: params[:id])
        movie.destroy