app/controllers/watch_lists_controller.rb

SELECT "watch_lists".* FROM "watch_lists"
---
    def index
        render json: WatchList.all

INSERT INTO "watch_lists" ("name", "created_at", "updated_at") VALUES (?, ?, ?)  [["name", "2021 test list"], ["created_at", "2021-05-07 08:12:19.201056"], ["updated_at", "2021-05-07 08:12:19.201056"]]
---
    def create
        watchlist = WatchList.create(watchlist_params)

SELECT "watch_lists".* FROM "watch_lists" WHERE "watch_lists"."id" = ? LIMIT ?  [["id", 5], ["LIMIT", 1]]
UPDATE "watch_lists" SET "name" = ?, "updated_at" = ? WHERE "watch_lists"."id" = ?  [["name", "Hobbits"], ["updated_at", "2021-05-09 08:02:16.702499"], ["id", 8]]
---
    def update
        watchlist = WatchList.find_by(id: params[:id])
        watchlist.update(watchlist_params)

SELECT "watch_lists".* FROM "watch_lists" WHERE "watch_lists"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
DELETE FROM "watch_lists" WHERE "watch_lists"."id" = ?  [["id", 3]]
---
    def destroy
        watchlist = WatchList.find_by(id: params[:id])
        watchlist.destroy